[
    {
        "id":"graveyard_quest",
        "name":"Mine for the taking",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I stumbled across a treasure chest in a clearing south of the Waterway house but the chest is protected by some form of magic and cannot be opened."
            },
            {
                "progress":20,
                "logText":"I encountered a traveler a short distance from the treasure chest. He told me there is a legend that the key to the chest is held by one of the undead that roam the cemetery to the south of the chest. However, the entrance to the cemetery is sealed by a magical force."
            },
            {
                "progress":30,
                "logText":"The traveler told me that Hagale in the Wood settlement might know how to enter the cemetery."
            },
            {
                "progress":35,
                "logText":"I went to the Wood settlement and found Hagale. He was a drunk mess and would not speak to me unless I brought him two Lowyna’s special brew."
            },
            {
                "progress":40,
                "logText":"Hagale said that the entrance to the cemetery was also sealed with magic to safeguard the key to the chest. The seal can only be broken by defeating the undead monster. However, Hagale found an ancient text that allows the holder to temporarily enter the cemetery. Hagale gave me the text."
            },
            {
                "progress":50,
                "logText":"I returned to the cemetery and was able to enter it using the ancient text just as Hagale had claimed.",
                "rewardExperience":500
            },
            {
                "progress":60,
                "logText":"I hacked through a horde of undead until I encountered one wearing a key."
            },
            {
                "progress":70,
                "logText":"I killed the undead and took the key."
            },
            {
                "progress":80,
                "logText":"I opened the chest, which contained a powerful sword. Next time I’m in the Wood settlement I should see if Hagale is still around.",
                "rewardExperience":2500
            },
            {
                "progress":90,
                "logText":"Hagale tried to rob me and take the sword, but I killed him and took it back.",
                "finishesQuest":1
            },
            {
                "progress":95,
                "logText":"Hagale tried to rob me and take the sword. He lost his wife and daughter and wasn't thinking straight. I gave him the sword without a fight.",
                "rewardExperience":1500,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"waterwayacave",
        "name":"Just the beginning",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"In a lonely house east of Loneford, I met an old man named Cithurn."
            },
            {
                "progress":15,
                "logText":"Cithurn told me that the surrounding forest has been under invasion by monsters for several weeks."
            },
            {
                "progress":20,
                "logText":"Cithurn heard something similar was occurring in Charwood until a young adventurer killed a vile beast in the mine beneath the city."
            },
            {
                "progress":25,
                "logText":"I told Cithurn about my role in Charwood and of my battle with Thukuzun."
            },
            {
                "progress":30,
                "logText":"Cithurn did not remember if the forest invasion began before the events in Charwood or after. However, based on my experiences in Charwood, Cithurn believes there is a connection between the two."
            },
            {
                "progress":35,
                "logText":"I promised Cithurn I would investigate the source of the monster invasion in the forest. I will have to pass though the forest to access an entrance to a cave northeast of Cithurn’s home"
            },
            {
                "progress":40,
                "logText":"I found the entrance to the cave."
            },
            {
                "progress":45,
                "logText":"I reached the end of the cave system. The air became damper the deeper I went."
            },
            {
                "progress":50,
                "logText":"Among the cold and damp lower parts of the cave, I encountered another dragon-like creature. This must be the source of all the chaos in the forest above. I should attempt to kill it."
            },
            {
                "progress":55,
                "logText":"I killed the monster called Tesrekan and took one of its bones as proof. I should venture back to Cithurn to tell him about it."
            },
            {
                "progress":60,
                "logText":"I presented one of the bones from the corpse of Tesrekan to Cithurn. He was happy to hear that I killed the source of the monster invasion. As we agreed, I returned his talisman.",
                "rewardExperience":7000,
                "finishesQuest":1
            },
            {
                "progress":70,
                "logText":"I presented one of the bones from the corpse of Tesrekan to Cithurn. He was happy to hear that I killed the source of the monster invasion. I decided to keep his talisman as payment for my hard work.",
                "rewardExperience":4500,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"nondisplay_2",
        "name":"Placeholder for hidden quest stages 2 (not displayed)",
        "stages":[
            {
                "progress":10,
                "logText":"Got Cithurn's talisman"
            },
            {
                "progress":20,
                "logText":"Found gold on waytolake7b"
            },
            {
                "progress":30,
                "logText":"Found gem 1 on waytolake6"
            },
            {
                "progress":40,
                "logText":"Found gem 2 on waytolake6"
            },
            {
                "progress":50,
                "logText":"Met Aemens"
            },
            {
                "progress":60,
                "logText":"Was warned about Aemens"
            },
            {
                "progress":70,
                "logText":"Told Aemens the neighbor warned you about her"
            },
            {
                "progress":75,
                "logText":"Taret tells you to be more careful what you say"
            },
            {
                "progress":80,
                "logText":"Looted corpse in warterway cave"
            },
            {
                "progress":90,
                "logText":"Got repreimanded by Cithurn"
            },
            {
                "progress":100,
                "logText":"Petted Cithurn's cat",
                "rewardExperience":25
            },
            {
                "progress":110,
                "logText":"Have discovered hidden room"
            },
            {
                "progress":120,
                "logText":"Returned Cithurn's talisman after initially saying you would keep it."
            },
            {
                "progress":130,
                "logText":"Found old clothes"
            }
        ]
    }
]